# Считываем строку
s = input()
# Выводим третий символ строки
print(s[2])
# Выводим предпоследний символ строки
print(s[-2])
# Выводим первые пять символов строки
print(s[:5])
# Выводим всю строку, кроме последних двух символов
print(s[:-2])
# Выводим все символы с четными индексами
print(s[::2])
# Выводим все символы с нечетными индексами
print(s[1::2])
# Выводим все символы в обратном порядке
print(s[::-1])
# Выводим все символы строки через один в обратном порядке, начиная с последнего
print(s[::-2])
# Выводим длину строки
print(len(s))







