# Даны три целых числа. Выведите значение наименьшего из них.
# Считываем три числа
a = float(input())
b = float(input())
c = float(input())

# Выводим наименьшее число
print(min(a, b, c))



